posts/2021-05-26-org-features/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Minor Org-Mode Features</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Minor Org-Mode Features</h1>
</header><p>
This post builds upon a previous post about <a href="/posts/2019-01-30-emacs-orglink">org-mode links</a>.
</p>

<div id="outline-container-custom-links" class="outline-2">
<h2 id="custom-links"><a href="#custom-links">Custom Links</a></h2>
<div class="outline-text-2" id="text-custom-links">
<p>
The in-buffer setting
</p>

<div class="org-src-container">
<pre class="src src-org">#+LINK: issue https://company.issue.tracker.com/ticket?id=

[[issue:42][Major Bug]]
</pre>
</div>

<p>
can also be written in elisp like this:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq org-link-abbrev-alist
      '(("issue" . "https://company.issue.tracker.com/ticket?id=%s")))
</pre>
</div>
</div>
</div>

<div id="outline-container-smart-browser-selection" class="outline-2">
<h2 id="smart-browser-selection"><a href="#smart-browser-selection">Smart Browser Selection</a></h2>
<div class="outline-text-2" id="text-smart-browser-selection">
<p>
Clicking a URL inside of org-mode opens your default browser. This behavior can
be customized using the variable <code>browse-url-browser-function</code>, which is handy
if a website only loads in a specific browser. You can either write your own URL
handler, or you can specify a regex based lookup list:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq browse-url-browser-function '(("intranet" . browse-url-chrome)
                                    ("google" . browse-url-chrome)
                                    ("." . browse-url-default-browser)))
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2021-05-26</p>
<footer>
<p>Copyright 2025, Florian Winkelbauer. All rights reserved.</p>
</footer>
</div>
</body>
</html>
